export const MessageConst = {
    AUTH:{
        REGISTER: "ثبت نام با موفقیت انجام شد.",
        LOGIN: "ورود شما با موفقیت انجام شد.",
        VERIFY:"کد تایید برای شما ارسال شد.",
        CHANGE_PASSWORD:"رمز عبور با موفقیت تغیر یافت."

    },
    CATEGORY:{
        CREATE:"دسته بندی با موفقیت ثبت شد.",
        UPDATE: "دسته بندی با موفقیت ویرایش شد.",
        DELETE: "دسته بندی با موفقیت حذف شد."
    },
    CATEGORY_SUBSET: {
        CREATE:"دسته بندی زیر مجموعه با موفقیت ثبت شد."
    },
    USER:{
        SAVE:"کاربر با موفقیت اضافه شد.",
        UPDATE:"کاربر با موفقیت ویرایش شد.",
        DELETE:"کاربر با موفقیت حذف شد",
    },
    POST:{
        SAVE:"پست با موفقیت اضافه شد."
    },
    POST_COMMENT:{
        ALL_PARENT_COMMENTS:"کامنت‌های والد با موفقیت دریافت شدند.",
        REPLY_COMMENT:"پاسخ با موفقیت ثبت شد."
    },
    CAR :{
        CONFIRMED: 'وضعیت خودرو اجاره دهنده با موفقیت با تایید شده تغیر یافت.',
        REJECT: 'وضعیت خودرو اجاره دهنده با موفقیت با رد شده تغیر یافت.'
    },
    GLOBAL:{
        GET_ROWS:"اطلاعات با موفقیت دریافت شد.",
        SAVE:"اطلاعات با موفقیت ذخیره شد.",
        UPDATE:'ویرایش با موفقیت انجام شد.',
        NOT_FOUND: "اطلاعات مورد نظر یافت نشد.",
        SUCCESS: "اطلاعات با موفقیت دریافت شد.",
        ERROR:"خطا در دریافت اطلاعات از سرور",
        DELETE:"اطلاعات با موفقیت حذف شد."
    },
    ORDER:{
        SAVE:"درخواست شما با موفقیت ثبت شد."
    }

}
